OpenFOAM_Maincode/tutorials/multiRegion/CHT/shellAndTubeHeatExchanger/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffles1
    {
        type        faceZone;
        zoneName    shell_to_solid;

        owner
        {
            name        shell_to_solid;
            type        mappedWall;
            neighbourRegion solid;
            neighbourPatch solid_to_shell;
        }

        neighbour
        {
            name        solid_to_shell;
            type        mappedWall;
            neighbourRegion shell;
            neighbourPatch shell_to_solid;
        }
    }

    baffles2
    {
        type        faceZone;
        zoneName    tube_to_solid;

        owner
        {
            name        tube_to_solid;
            type        mappedWall;
            neighbourRegion solid;
            neighbourPatch solid_to_tube;
        }

        neighbour
        {
            name        solid_to_tube;
            type        mappedWall;
            neighbourRegion tube;
            neighbourPatch tube_to_solid;
        }
    }
}


// ************************************************************************* //
